# DataFrames

Aqui vamos aprender o que seria e como usar os *DataFrames* ,que são elementos principais, que são tabelas e que estas são composições de series.

Começamos importando a biblioteca numpy que é para uso de operações com algebra linear

In [7]:
from numpy.random import randn
import pandas as pd

Veja os metodos da criação de dataframe, veja q o 5,4 serviu para criar numeros aleatorios de 5 linhas para 4 colunas

In [81]:
df = pd.DataFrame(randn(5,4), index=['A','B','C','D','E'], columns='W X Y Z'.split()) 
df

          W         X         Y         Z
A -0.740971  0.123152 -0.477661  0.659734
B -0.778957 -0.204003 -0.862113  0.115837
C -0.059345 -1.787974  0.039402  0.142528
D -0.669847 -0.714158  0.603890  0.998627
E  0.783549  0.769988  2.777054 -0.778580

Voce pode selecionar os dados pelos seus respectivos indices

In [11]:
df['W']

A    1.431234
B    0.330133
C    1.047447
D    0.012851
E    1.576921
Name: W, dtype: float64

Acima veja que o comportamento acima se assemelha a uma series, para se comportar como um dataframes é necessario de um conjunto mesmo que seja vazio é possivel representar

In [12]:
df[['W']]

          W
A  1.431234
B  0.330133
C  1.047447
D  0.012851
E  1.576921

In [84]:
df['new'] = df['W'] + df['X']
df

          W         X         Y         Z       new
A -0.740971  0.123152 -0.477661  0.659734 -0.617819
B -0.778957 -0.204003 -0.862113  0.115837 -0.982960
C -0.059345 -1.787974  0.039402  0.142528 -1.847320
D -0.669847 -0.714158  0.603890  0.998627 -1.384005
E  0.783549  0.769988  2.777054 -0.778580  1.553537

Agora vejamos o comportamento do drop(lembre-se o axis se refere ao eixo, eixo 0 se refere a linha e o eixo 1 se refere a coluna)

In [85]:
df1 = df.drop('new',axis=1)

porem ao reproduzirmos novamentes, é visto que o a coluna volta a aparecer

In [86]:
df

          W         X         Y         Z       new
A -0.740971  0.123152 -0.477661  0.659734 -0.617819
B -0.778957 -0.204003 -0.862113  0.115837 -0.982960
C -0.059345 -1.787974  0.039402  0.142528 -1.847320
D -0.669847 -0.714158  0.603890  0.998627 -1.384005
E  0.783549  0.769988  2.777054 -0.778580  1.553537

A maioria das funções do pandas e dataframes, elas não alteram o original, elas fazem a operação em uma copia e te entregam uma copia, mas o original é preservado, tem algumas maneiras de se resolver voce passa o valor do que voce quer modificar para uma variavel

In [87]:
df1

          W         X         Y         Z
A -0.740971  0.123152 -0.477661  0.659734
B -0.778957 -0.204003 -0.862113  0.115837
C -0.059345 -1.787974  0.039402  0.142528
D -0.669847 -0.714158  0.603890  0.998627
E  0.783549  0.769988  2.777054 -0.778580

E uma maneira para alterar realmente o valor original as funçõs quase todas geralmente vem com um metodo para isso com **inplace =True**, veja que se voce rodar na linha abaixo mais de uma vez o erro vai se instaurar, pois removemos new do valor original e quando ele for buscar esse valor novamente ele não vai existir mais e vai dar o erro

In [88]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A -0.740971  0.123152 -0.477661  0.659734
B -0.778957 -0.204003 -0.862113  0.115837
C -0.059345 -1.787974  0.039402  0.142528
D -0.669847 -0.714158  0.603890  0.998627
E  0.783549  0.769988  2.777054 -0.778580

procurando uma linha usando a função loc

In [89]:
df.loc['A']

W   -0.740971
X    0.123152
Y   -0.477661
Z    0.659734
Name: A, dtype: float64

procurando de maneira melhor e geral com iloc

Quando usamos os ":" estamos dizendo tudo, é o total e o numero que voce bota em seguida é a parada, ate onde ele vai 
Aqui nos vemos q ele percorre ate o 4 elemento apenas,

In [79]:
df.iloc[:-1,:]

Empty DataFrame
Columns: []
Index: [A, B, C, D]

In [47]:
df.iloc[1:4,1:3]

          X         Y
B -0.130732 -0.071739
C  1.339020  0.015098
D  0.336483 -0.421248

Podemos fazer operações aritmeticas e condicionais

In [48]:
df + df

          W         X         Y         Z       new
A  2.862469 -1.850144 -1.012777  0.984891  1.012325
B  0.660265 -0.261465 -0.143478 -1.103006  0.398800
C  2.094894  2.678040  0.030196 -0.524353  4.772934
D  0.025703  0.672966 -0.842495 -0.562309  0.698668
E  3.153841 -1.608899  0.012561 -1.251788  1.544942

In [49]:
df > 0

      W      X      Y      Z   new
A  True  False  False   True  True
B  True  False  False  False  True
C  True   True   True  False  True
D  True   True  False  False  True
E  True  False   True  False  True

In [50]:
df[df>0]

          W         X         Y         Z       new
A  1.431234       NaN       NaN  0.492445  0.506162
B  0.330133       NaN       NaN       NaN  0.199400
C  1.047447  1.339020  0.015098       NaN  2.386467
D  0.012851  0.336483       NaN       NaN  0.349334
E  1.576921       NaN  0.006281       NaN  0.772471

In [53]:
df['new'] > 0

A    True
B    True
C    True
D    True
E    True
Name: new, dtype: bool

In [92]:
novoind = 'PI MA AMA CE SP'.split()

df["novo_index"] = novoind

In [91]:

df

          W         X         Y         Z novo_index
A -0.740971  0.123152 -0.477661  0.659734         PI
B -0.778957 -0.204003 -0.862113  0.115837         MA
C -0.059345 -1.787974  0.039402  0.142528        AMA
D -0.669847 -0.714158  0.603890  0.998627         CE
E  0.783549  0.769988  2.777054 -0.778580         SP

In [ ]:
df.set_index("novo_index",inplace=True)

In [95]:
df

                   W         X         Y         Z
novo_index
PI         -0.740971  0.123152 -0.477661  0.659734
MA         -0.778957 -0.204003 -0.862113  0.115837
AMA        -0.059345 -1.787974  0.039402  0.142528
CE         -0.669847 -0.714158  0.603890  0.998627
SP          0.783549  0.769988  2.777054 -0.778580